InformationRegisters/Renault_BP_РезультатыКампаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_BP_РезультатыКампаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_БонусныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выплата</Name>
					<Comment>название тэга для вставки в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_BP_ДетализацияРезультатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_BP_ДетализацияРезультатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выплата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_БонусныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/Renault_BonusPaymentЗагрузкаДанных/Ext/Module.bsl
Функция ПолучитьМассивБирДляПолученияДанных() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CRM_ДилерскиеЦентры.BIR_Distri
	               |ИЗ
	               |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	               |ГДЕ
	               |	CRM_ДилерскиеЦентры.BIR_Distri <> """"";
	МассивСтрокБИР = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("BIR_Distri");
	
	МассивБИР = Новый Массив;
	Для Каждого СтрокаБИР Из МассивСтрокБИР Цикл
		МассивБИРСтроки = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(СтрокаБИР, ",");
		Для Каждого БИР Из МассивБИРСтроки Цикл
			Если МассивБИР.Найти(БИР) = Неопределено Тогда
				МассивБИР.Добавить(БИР);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивБИР;	
	
КонецФункции


Функция ПолучитьПрокси() Экспорт 
	
	Адрес = "http://gate.rnlt.ru/dms-dictionary/ws/bonuspayment.1cws?wsdl";
	ЛогинWS = "Администратор";
	ПарольWS = "logan30";	
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		ОпределениеСервиса, 
		"http://renault.ru/BonusPayment", 
		"BonusPayment",
		"BonusPaymentSoap12",
		3600);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	
КонецФункции

Процедура BonusPaymentЗагрузкаДанных1() Экспорт
	
	
	
КонецПроцедуры


Процедура BonusPaymentЗагрузкаДанных(Параметр = Неопределено) Экспорт
	
	BIRы = ПолучитьМассивБирДляПолученияДанных();
	BIR = BIRы[0];
	Прокси = ПолучитьПрокси();
	
	СериализованнаяТаблица = Прокси.GetCampains();
	Таблица = СериализаторXDTO.ПрочитатьXDTO(СериализованнаяТаблица);
	Для Каждого Строка Из Таблица Цикл
		Ссылка = Справочники.Renault_БонусныеКампании.НайтиПоКоду(Строка.Код);
		Если Ссылка = Неопределено Или Ссылка = Справочники.Renault_БонусныеКампании.ПустаяСсылка() Тогда
			Кампания = справочники.Renault_БонусныеКампании.СоздатьЭлемент();
			Кампания.Код = Строка.Код;
		Иначе
			Кампания = Ссылка.ПолучитьОбъект();
		КонецЕсли;
		      
		Кампания.Наименование = Строка.Наименование;
		Кампания.Описание = Строка.Описание;
		
		Кампания.Записать();
	КонецЦикла;	
	
	СериализованнаяТаблица = Прокси.GetResults(BIR);
	Таблица = СериализаторXDTO.ПрочитатьXDTO(СериализованнаяТаблица);
	Для Каждого Строка Из Таблица Цикл
		Кампания = Справочники.Renault_БонусныеКампании.НайтиПоКоду(Строка.Код);
		Если Кампания = Неопределено Или Кампания = Справочники.Renault_БонусныеКампании.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;

		Набор = РегистрыСведений.Renault_BP_РезультатыКампаний.СоздатьНаборЗаписей();
		Набор.Отбор.Кампания.Установить(Кампания);
		Набор.Записать();
		
	КонецЦикла;
	Для Каждого Строка Из Таблица Цикл
		Кампания = Справочники.Renault_БонусныеКампании.НайтиПоКоду(Строка.Код);
		Если Кампания = Неопределено Или Кампания = Справочники.Renault_БонусныеКампании.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.Renault_BP_РезультатыКампаний.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Кампания = Кампания;
		МенеджерЗаписи.Дилер = Строка.Дилер;
		МенеджерЗаписи.Выплата = Строка.Выплата;
		МенеджерЗаписи.Сумма = Строка.Сумма;
		МенеджерЗаписи.Описание = Строка.Описание;
		
		МенеджерЗаписи.Записать();	
	КонецЦикла;
	
	СериализованнаяТаблица = Прокси.GetDetails(BIR);
	Таблица = СериализаторXDTO.ПрочитатьXDTO(СериализованнаяТаблица);
	Для Каждого Строка Из Таблица Цикл
		Кампания = Справочники.Renault_БонусныеКампании.НайтиПоКоду(Строка.Код);
		Если Кампания = Неопределено Или Кампания = Справочники.Renault_БонусныеКампании.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;

		Набор = РегистрыСведений.Renault_BP_ДетализацияРезультатов.СоздатьНаборЗаписей();
		Набор.Отбор.Кампания.Установить(Кампания);
		Набор.Записать();
		
	КонецЦикла;
	Для Каждого Строка Из Таблица Цикл
		Кампания = Справочники.Renault_БонусныеКампании.НайтиПоКоду(Строка.Код);
		Если Кампания = Неопределено Или Кампания = Справочники.Renault_БонусныеКампании.ПустаяСсылка() Тогда
			Продолжить;			
		КонецЕсли;	
		
		МенеджерЗаписи = РегистрыСведений.Renault_BP_ДетализацияРезультатов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Кампания = Кампания;
		МенеджерЗаписи.Дилер = Строка.Дилер;
		МенеджерЗаписи.VIN = Строка.VIN;
		МенеджерЗаписи.Выплата = Строка.Выплата;
		МенеджерЗаписи.Сумма = Строка.Сумма;
		МенеджерЗаписи.Комментарий1 = Строка.Комментарий1;
		МенеджерЗаписи.Комментарий2 = Строка.Комментарий2;
		МенеджерЗаписи.Комментарий3 = Строка.Комментарий3;
		МенеджерЗаписи.Комментарий4 = Строка.Комментарий4;
		МенеджерЗаписи.Комментарий5 = Строка.Комментарий5;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
